In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']
my_list = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a': 10, 'b': 20, 'c': 100}

In [4]:
pd.Series(
    data=my_list,
    index=labels
)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(d)

a     10
b     20
c    100
dtype: int64

In [11]:
df = pd.DataFrame(
    data = np.random.randn(5, 4), 
    index=['A', 'B', 'C', 'D', 'E'], 
    columns=['W', 'X', 'Y', 'Z'])

In [12]:
df

          W         X         Y         Z
A  1.362054  0.450553 -1.747894 -1.304787
B  0.542552  1.173748 -0.416686  1.149878
C -0.379546 -1.496427 -0.306667 -1.518263
D  0.789651 -1.645537 -1.634037 -1.110836
E -0.492099  0.609153  1.073673  0.955230

In [13]:
df['W']

A    1.362054
B    0.542552
C   -0.379546
D    0.789651
E   -0.492099
Name: W, dtype: float64

In [14]:
df['new'] = df['W'] + df['Y']

In [15]:
df

          W         X         Y         Z       new
A  1.362054  0.450553 -1.747894 -1.304787 -0.385840
B  0.542552  1.173748 -0.416686  1.149878  0.125866
C -0.379546 -1.496427 -0.306667 -1.518263 -0.686213
D  0.789651 -1.645537 -1.634037 -1.110836 -0.844386
E -0.492099  0.609153  1.073673  0.955230  0.581574

In [16]:
df = df.drop('new', axis=1)

In [17]:
df

          W         X         Y         Z
A  1.362054  0.450553 -1.747894 -1.304787
B  0.542552  1.173748 -0.416686  1.149878
C -0.379546 -1.496427 -0.306667 -1.518263
D  0.789651 -1.645537 -1.634037 -1.110836
E -0.492099  0.609153  1.073673  0.955230

In [18]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.362054  0.450553 -1.747894 -1.304787
1     B  0.542552  1.173748 -0.416686  1.149878
2     C -0.379546 -1.496427 -0.306667 -1.518263
3     D  0.789651 -1.645537 -1.634037 -1.110836
4     E -0.492099  0.609153  1.073673  0.955230

In [19]:
df

          W         X         Y         Z
A  1.362054  0.450553 -1.747894 -1.304787
B  0.542552  1.173748 -0.416686  1.149878
C -0.379546 -1.496427 -0.306667 -1.518263
D  0.789651 -1.645537 -1.634037 -1.110836
E -0.492099  0.609153  1.073673  0.955230

In [20]:
df['states'] = ['CA', 'NY', 'WY', 'OR', 'CO']

In [21]:
df

          W         X         Y         Z states
A  1.362054  0.450553 -1.747894 -1.304787     CA
B  0.542552  1.173748 -0.416686  1.149878     NY
C -0.379546 -1.496427 -0.306667 -1.518263     WY
D  0.789651 -1.645537 -1.634037 -1.110836     OR
E -0.492099  0.609153  1.073673  0.955230     CO

In [22]:
df.set_index('states')

               W         X         Y         Z
states
CA      1.362054  0.450553 -1.747894 -1.304787
NY      0.542552  1.173748 -0.416686  1.149878
WY     -0.379546 -1.496427 -0.306667 -1.518263
OR      0.789651 -1.645537 -1.634037 -1.110836
CO     -0.492099  0.609153  1.073673  0.955230

In [23]:
df

          W         X         Y         Z states
A  1.362054  0.450553 -1.747894 -1.304787     CA
B  0.542552  1.173748 -0.416686  1.149878     NY
C -0.379546 -1.496427 -0.306667 -1.518263     WY
D  0.789651 -1.645537 -1.634037 -1.110836     OR
E -0.492099  0.609153  1.073673  0.955230     CO

In [24]:
df = df.set_index('states')

In [25]:
df

               W         X         Y         Z
states
CA      1.362054  0.450553 -1.747894 -1.304787
NY      0.542552  1.173748 -0.416686  1.149878
WY     -0.379546 -1.496427 -0.306667 -1.518263
OR      0.789651 -1.645537 -1.634037 -1.110836
CO     -0.492099  0.609153  1.073673  0.955230

In [26]:
d = {
    'A': [1, 2, np.nan],
    'B': [5, np.nan, np.nan],
    'C': [1, 2, 3]
}

In [27]:
df = pd.DataFrame(d)

In [28]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [30]:
df.dropna(axis=1) # axis = 0 among rows, axis = 1 among columns

   C
0  1
1  2
2  3

In [31]:
data = {
    'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'Sales': [200, 120, 340, 124, 243, 350]
}

In [32]:
df = pd.DataFrame(data)

In [33]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [34]:
df.groupby('Company')

In [35]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0